const localization = {
  ru: {
    navMenu: 'Меню',
    navSettings: 'Настраивай',
    navChoose: 'Выбирай',
    navTake: 'Забирай',

    consumerTitle: 'Настраивай свой кофе, как любишь',
    sergey: 'Сергей, байкер<br> верен своему макиато',
    mila: 'Мила, балерина<br> вдохновляется<br> вкусом крепкого эспрессо',
    igor: 'Игорь, фитнес тренер<br> экспериментирует<br> с кофейными коктейлями',

    settingsTitle: 'Готовь<br> кофе прямо<br> с мобильного',
    settingsText: 'Без ума от кофе? Необязательно стоять в очереди в кофейню, кофемашина Dinamica + — персональный бариста в твоем доме.  Хороший кофе ближе чем ты думаешь. Готовь вкусные напитки с кофемашиной Dinamica + прямо у себя дома.',

    typesCoffeeTitle: 'Выбирай<br> свой вкус',

    popupQwText: 'Какой твой любимый кофе?',
    popupQwButton: 'Пройти опрос',

    orderTitle: 'Твой идеальный бариста',
    orderText: 'При покупке кофемашины Delonghi Dinamica + вы получаете не только идеального помощника, а еще 1 кг кофе и кружки для капучино в подарок!',
    getOrder: 'купить',
    orderDelivery: 'Бесплатная доставка по Москве и Московской области',
    orderGarant: 'Официальная гарантия от производителя',
    featuresBtn: 'Особенности Delonghi Dinamica + ',

    license: 'Все права защищены',
    d2: 'Разработано компанией ',

    popupOrderTitle: 'Оформление заказа',
    send: 'Отправить',
    popupOrderInfo: 'Нажимая на кнопку Отправить, вы даете согласие на обработку персональных данных',
    popupOrderSuccess: 'Спасибо!<br> Заявка отправлена',
    popupOrderSuccessText: 'Наш менеджер свяжется с вамив ближайшее время для уточнения деталей заказа',

    popupSurveyTitle: 'Узнай больше о любимом кофе',
    popupSurveyDesc: ' За хорошим, вкусным кофе не обязательно идти в кофейню. Кофемашина DeLonghi ECAM 370.95. — твой персональный бариста. Управляй им через приложение ',

    blacCoffee: 'Черный <br /> кофе',
    espresso: 'Эспрессо',
    coldCoffee: 'Холодный <br /> кофе',
    italianMacchiato: 'Итальянский <br /> макиато',
    espressoLungo: 'Эспрессо <br /> Лунго',
    capuchinoMix: 'Капучино <br /> микс',
    latteMacchiato: 'Латте <br /> макиато',
    capuchino: 'Капучино',
    hotChocolate: 'Горячий <br /> шоколад',
    flatWhite: 'Флэт уайт',

    popupBlacCoffee: 'Черный кофе',
    popupBlacCoffeeDesc: 'Международный напиток так хорошо знакомый и любимый многими людьми. Менее насыщенный, чем у эспрессо вкус, тонкая пенка crema и деликатный оттенок делают черных кофе поводом для наслаждения в любое время дня.',

    popupEspresso: 'Эспрессо',
    popupEspressoDesc: ' Это итальянский способ наслаждаться кофе. О правильности приготовления данного напитка свидетельствует плотная пенка «crema» орехового цвета. Крепкий оттенок и продолжительное послевкусие – то что нужно для идеального утреннего ритуала!  Название напитка в переводе с итальянского означает «быстро»/ «мгновенно».  ', 

    popupColdCoffee: 'Холодный кофе',
    popupColdCoffeeDesc: ' Освежающая версия аутентичного итальянского эспрессо с холодной кремовой кофейной пеной. Прекрасный напиток для жаркого летнего дня, когда хочется получить заряд бодрости и превосходный вкус одновременно.  C кофемашиной De’Longhi Primadonna Elite (ECAM650.85) вы всегда сможете наслаждаться холодным кофе, она оснащена специальным контейнером и насадкой для вспенивания, обеспечивающими целую гамму новых кофейных сочетаний.  ',

    popupItalianMacchiato: 'Итальянский макиато',
    popupItalianMacchiatoDesc: ' Небольшое количество пышной молочной пены поверх двойной порции крепкого эспрессо – вот идеальная формула этого напитка. В переводе с итальянского его название переводится как «пятнистый» / «окрашенный».  Эспрессо макиато подойдет для тех, кому нравится сочетание интенсивного кофейного аромата и воздушного облака молочных акцентов.  ',

    popupEspressoLungo: 'Эспрессо Лунго',
    popupEspressoLungoDesc: ' Увеличив время экстракции и объем традиционного эспрессо в 2 раза, вы получите совершенно новый напиток, с иной гаммой ароматов и нюансов. Лунго содержит намного больше кофеина, поэтому это прекрасный способ взбодриться после долгого рабочего дня, а еще этот напиток подходит для длительных бесед и встреч с друзьями.  ',

    popupCapuchinoMix: 'Капучино микс',
    popupCapuchinoMixDesc: ' Капучино микс – это напиток, который вы можете попробовать в настоящей итальянской кофейне. К порции крепкого эспрессо добавляется горячее молоко, а не наоборот, как при приготовлении стандартного Капучино, благодаря этому насыщенный кофейный аромат и вкус чувствуются даже в молочной пене.  ',

    popupLatteMacchiato: 'Латте макиато',
    popupLatteMacchiatoDesc: ' Molto bello! Латте макиато создан для ценителей сливочного вкуса, разбавленного легкой кофейной терпкостью.  Три части бархатистой молочной пены на одну порцию эспрессо – это один из популярнейших рецептов в Центральной и Западной Европе.  Впервые термин «café latte» был использован в английском языке в 1867 году.  ',

    popupCapuchino: 'Капучино',
    popupCapuchinoDesc: ' Одна треть крепкого эспрессо, одна треть нагретого до правильной температуры молока и одна треть плотной воздушной молочной пены – три составляющих идеального капучино вкусом которого наслаждаешься от первого глотка и до последней капли.  Происхождение названия напитка связывают с оттенком одеяния монахов ордена капуцинов, напоминающим цвет кофе с молоком.  ',

    popupHotChocolate: 'Горячий шоколад',
    popupHotChocolateDesc: ' Готовится в специальном контейнере кофемашины De’Longhi Primadonna Elite (ECAM650.85) с добавлением к порошкообразному шоколаду небольшого количества молока либо с использованием шоколадных каллет.  Настоящее лакомство для любителей сладостей и изысканного шоколадного вкуса, которое всегда можно приготовить у себя дома.  ',

    popupFlatWhite: 'Флэт уайт',
    popupFlatWhiteDesc: ' Напиток родом из Австралии, покоривший Западную Европу. Он имеет более выраженный кофейный вкус нежели латте макиато, благодаря соотношению молока и кофе.  Название «ФЛЭТ УАЙТ» от англ. «flat» – плоский, связано с тем, что в напитке практически отсутствует пышная молочная пена, его поверхность гладкая и глянцевая.  ',

    featureTouchTitle: 'Технология одного прикосновения',
    featureTouchDesc: ' Приготовьте идеальный кофе и молочные напитки одним нажатием кнопки.  Новая технология одного касания использует современную электронику с интуитивными контролями для простого приготовления ваших любимых напитков.',

    featureContainerTitle: 'Новый контейнер для молока',
    featureContainerDesc: ' Новый контейнер под молоко выполнен из высококачественного пластика с двойными стенками. Благодаря двойным стенкам, оптимальная температура молока будет сохраняться дольше, что позволит вам наслаждаться любимыми напитками.  ',

    featureLattecremaTitle: 'Lattecrema System',
    featureLattecremaDesc: ' Благодаря технологии с отдельной гидравлической системой, точной электроникой и специальным контейнером для молока, система LatteCrema System смешивает пар, воздух и молоко в нужной пропорции, чтобы обеспечивать получение идеальной молочной пены для Ваших любимых кофейных напитков с молоком.  ',

    featureMobileTitle: 'Мобильное приложение',
    featureMobileDesc: 'Кофемашиной можно управлять дистанционно через приложение Coffee Link и создавать новые рецепты при полной свободе действий (синхронизация через Bluetooth). Приложение позволяет готовить напитки, а также создавать и сохранять в памяти машины новые уникальные рецепты с помощью смартфона.',
  },
  uk: {
    navMenu: 'Меню',
    navSettings: 'Налаштовуй',
    navChoose: 'Обирай',
    navTake: 'Забирай',

    consumerTitle: 'Налаштовуй свою каву, як любиш',
    sergey: 'Сергій, байкер<br> вірний своєму макиато',
    mila: 'Міла, балерина<br> надихається смаком міцного еспресо',
    igor: 'Ігор, фітнес тренер<br> експериментує з кавовими коктейлями',

    settingsTitle: 'Готуй<br> каву просто<br> з мобільного',
    settingsText: "Шаленієш від кави? Необов'язково стояти в черзі в кав'ярню, кавоварка Dinamica + - персональний бариста в твоєму домі. Добра кава ближче ніж ти думаєш. Готуй смачні напої з кавоваркою Dinamica + прямо у себе вдома.",

    typesCoffeeTitle: 'Обирай<br> свій смак',

    popupQwText: 'Яка твоя улюблена кава?',
    popupQwButton: 'Пройти опитування',

    orderTitle: 'Твій ідеальний бариста',
    orderText: 'При покупці кавоварки Delonghi Dinamica + ви отримуєте не тільки ідеального помічника, а ще 1 кг кави і кухлі для капучино в подарунок!',
    getOrder: 'купити',
    orderDelivery: 'Безкоштовна доставка по всій Україні',
    orderGarant: 'Офіційна гарантія від виробника',
    featuresBtn: 'Особливості Delonghi Dinamica +',

    license: 'Офіційна гарантія від виробника',
    d2: 'Розроблено компанією ',

    popupOrderTitle: 'Оформлення замовлення',
    send: 'відправити',
    popupOrderInfo: 'Натискаючи на кнопку Відправити, ви даєте згоду на обробку персональних даних',
    popupOrderSuccess: 'Спасибі!<br> заявку відправлено',
    popupOrderSuccessText: "Наш менеджер зв'яжеться з вами найближчим часом для уточнення деталей замовлення",

    popupSurveyTitle: 'Дізнайся більше про улюблену каву',
    popupSurveyDesc: "За доброю, смачною кавою не обов'язково йти в кав'ярню. Кофемашина DeLonghi ECAM 370.95. - твій персональний бариста. Керуй їм через додаток",

    blacCoffee: 'Чорна<br> кава',
    espresso: 'Еспресо',
    coldCoffee: 'Холодна<br> кава',
    italianMacchiato: 'Італійський<br> макіато',
    espressoLungo: 'Еспресо<br> Лунго',
    capuchinoMix: 'Капучино<br> мікс',
    latteMacchiato: 'Латте<br> макіато',
    capuchino: 'Капучино',
    hotChocolate: 'Гарячий<br> шоколад',
    flatWhite: 'Флет<br> уайт',

    popupBlacCoffee: 'Чорна кава',
    popupBlacCoffeeDesc: 'Міжнародний напій так добре знайомий і улюблений багатьма людьми. Менш насичений, ніж у еспресо смак, тонка пінка crema і делікатний відтінок роблять чорну каву приводом для насолоди в будь-який час дня.',

    popupEspresso: 'Еспресо',
    popupEspressoDesc: 'Це італійський спосіб насолоджуватися кавою. Про правильність приготування даного напою свідчить щільна пінка «crema» горіхового кольору. Міцний відтінок і тривалий післясмак - то що потрібно для ідеального ранкового ритуалу! Назва напою в перекладі з італійської означає «швидко»/«миттєво».', 

    popupColdCoffee: 'Холодна кава',
    popupColdCoffeeDesc: "Освіжаюча версія автентичного італійського еспресо з холодною кремовою кавовою піною. Прекрасний напій для спекотного літнього дня, коли хочеться отримати заряд бадьорості і чудовий смак одночасно. З кавоваркою De'Longhi Primadonna Elite (ECAM650.85) ви завжди зможете насолоджуватися холодною кавою, вона обладнана спеціальним контейнером і насадкою для спінювання, що забезпечують цілу гаму нових кавових поєднань.",

    popupItalianMacchiato: 'Італійський макіато',
    popupItalianMacchiatoDesc: 'Невелика кількість пишної молочної піни поверх подвійної порції міцного еспресо - ось ідеальна формула цього напою. У перекладі з італійського його назва перекладається як «плямистий»/«забарвлений». Еспресо макіато підійде для тих, кому подобається поєднання інтенсивного кавового аромату і повітряної хмари молочних акцентів.',

    popupEspressoLungo: 'Еспресо Лунго',
    popupEspressoLungoDesc: 'Збільшивши час екстракції і обсяг традиційного еспресо в 2 рази, ви отримаєте абсолютно новий напій, з іншої гамою ароматів і нюансів. Лунго містить набагато більше кофеїну, тому це прекрасний спосіб підбадьоритися після довгого робочого дня, а ще цей напій підходить для тривалих бесід і зустрічей з друзями.',

    popupCapuchinoMix: 'Капучино мікс',
    popupCapuchinoMixDesc: "Капучино мікс - це напій, який ви можете спробувати в справжній італійській кав'ярні. До порції міцного еспресо додається гаряче молоко, а не навпаки, як при приготуванні стандартного Капучино, завдяки цьому насичений кавовий аромат і смак відчуваються навіть у молочній піні.",

    popupLatteMacchiato: 'Латте макіато',
    popupLatteMacchiatoDesc: 'Molto bello! Латте макіато створений для поціновувачів вершкового смаку, розведенний легкою кавовою терпкістю. Три частини оксамитової молочної піни на одну порцію еспресо - це один з найпопулярніших рецептів в Центральній і Західній Європі. Вперше термін «café latte» був використаний в англійській мові у 1867 році.',

    popupCapuchino: 'Капучино',
    popupCapuchinoDesc: "Одна третина міцного еспресо, одна третина нагрітого до правильної температури молока і одна третина щільної повітряної молочної піни - три складових ідеального капучино смаком якого насолоджуєшся від першого ковтка и до останньої краплі. Походження назви напою пов'язують з відтінком вбрання монахів ордену капуцинів, що нагадує колір кави з молоком.",

    popupHotChocolate: 'Гарячий шоколад',
    popupHotChocolateDesc: "Готується в спеціальному контейнері кавомашини De'Longhi Primadonna Elite (ECAM650.85) з додаванням до порошкоподібного шоколаду невеликої кількості молока або з використанням шоколадних каллет. Справжні ласощі для шанувальників солодощів та вишуканого шоколадного смаку, який завжди можна приготувати у себе вдома.",

    popupFlatWhite: 'Флет уайт',
    popupFlatWhiteDesc: "Напій походить з Австралії, який підкорив Західну Європу. Він має більш виражений кавовий смак ніж латте макіато, завдяки співвідношенню молока і кави. Назва «Флет УАЙТ» від англ. «Flat» - плоский, пов'язане з тим, що в напої практично відсутня пишна молочна піна, його поверхня гладка і глянсова.",

    featureTouchTitle: 'Технологія одного дотику',
    featureTouchDesc: 'Приготуйте ідеальну каву та молочні напої одним натисканням кнопки. Нова технологія одного дотику використовує сучасну електроніку з інтуїтивним контролем для простого приготування ваших улюблених напоїв.',

    featureContainerTitle: 'Новий контейнер для молока',
    featureContainerDesc: 'Новий контейнер під молоко виконаний з високоякісного пластику з подвійним корпусом. Завдяки подвійному корпусу, оптимальна температура молока буде зберігатися довше, що дозволить вам насолоджуватися улюбленими напоями.',

    featureLattecremaTitle: 'Lattecrema System',
    featureLattecremaDesc: 'Завдяки технології з окремою гідравлічною системою, точної електроніці і спеціальним контейнером для молока, система LatteCrema System змішує пар, повітря і молоко в потрібній пропорції, чим забезпечує отримання ідеальної молочної піни для Ваших улюблених кавових напоїв з молоком.',

    featureMobileTitle: 'Мобільний додаток',
    featureMobileDesc: "Кавоваркою можна управляти дистанційно через додаток Coffee Link і створювати нові рецепти при повній свободі дій (синхронізація через Bluetooth). Додаток дозволяє готувати напої, а також створювати і зберігати в пам'яті машини нові унікальні рецепти за допомогою смартфона.",
  },
};

const translate = (lng) => {
  const elementsForTranslate = document.querySelectorAll('[data-localization]');
  const galaxyphone = document.querySelector('.galaxyphone');
  const translated = localization[lng];

  galaxyphone.src = lng === 'ru'
    ? '/assets/images/galaxy-2.png'
    : '/assets/images/galaxy-2-ua.png';

  elementsForTranslate.forEach(node => {
    node.innerHTML = translated[node.dataset.localization];
  });
};

const ruLngBtn = document.querySelectorAll('li[data-lang = "ru"]');
const uaLngBtn = document.querySelectorAll('li[data-lang = "ua"]');
const currentLng = localStorage.getItem('language')
  ? localStorage.getItem('language')
  : (navigator.language || navigator.userLanguage);

localStorage.setItem('language', currentLng);

if (currentLng === 'ru' || currentLng === 'ru-RU') {
  uaLngBtn.forEach(b => b.classList.remove('active'));
  ruLngBtn.forEach(b => b.classList.add('active'));
  translate('ru');
} else {
  uaLngBtn.forEach(b => b.classList.add('active'));
  ruLngBtn.forEach(b => b.classList.remove('active'));
  translate('uk');
}

ruLngBtn.forEach(btn => {
  btn.addEventListener('click', e => {
    uaLngBtn.forEach(b => b.classList.remove('active'));
    ruLngBtn.forEach(b => b.classList.add('active'));
    localStorage.setItem('language', 'ru');
    translate('ru');
  });
});

uaLngBtn.forEach(btn => {
  btn.addEventListener('click', e => {
    uaLngBtn.forEach(b => b.classList.add('active'));
    ruLngBtn.forEach(b => b.classList.remove('active'));
    localStorage.setItem('language', 'ua');
    translate('uk');
  });
});
